app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 9 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 9
---
  def destroy
    @user = User.find(params[:id])

    # Удаляем пользователя из базы данных
    if @user.destroy