app/views/users/show.html.erb

SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 12
---
          <div class="text-left">
            <p class="font-bold text-slate-900 text-base"><%= @user.posts.count %></p>

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 12 ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 6
---
        <h3 class="text-base font-bold text-slate-900">Публикации</h3>
        <span class="text-slate-400 text-sm font-normal">(<%= @user.posts.count %>)</span>

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 6 ORDER BY "posts"."created_at" DESC
---

      <% user_posts = @user.posts.order(created_at: :desc) %>