app/views/devise/sessions/new.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IN (12, 6, 1)
---
            <% else %>
              <%= post.user.username.first.upcase %>