app/views/posts/_post.html.erb

        <div style="width: 40px; height: 40px; border-radius: 50%; background: #e1e8ed; display: flex; align-items: center; justify-content: center; font-size: 16px; font-weight: bold; color: #777; border: 1px solid #eee;">
          <%= post.user.username.first.upcase %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1

      <% if user_signed_in? %>
        <% liked = post.likes.any? { |l| l.user_id == current_user.id } %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (18, 9, 8, 7, 6, 5, 4, 3, 2, 1)
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = 18

          <%= link_to post_like_path(post, id: 0), data: { turbo_method: :delete }, style: "text-decoration: none; color: #e0245e; font-size: 0.9rem; display: flex; align-items: center; gap: 4px; font-weight: bold;" do %>
            ❤️ <%= post.likes.count %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = 27
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = 9

          <%= link_to post_likes_path(post), data: { turbo_method: :post }, style: "text-decoration: none; color: #657786; font-size: 0.9rem; display: flex; align-items: center; gap: 4px;" do %>
            🤍 <%= post.likes.count %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = 33

        <span style="color: #657786; font-size: 0.9rem; display: flex; align-items: center; gap: 4px;">
          🤍 <%= post.likes.count %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = 32

      <%= link_to post_path(post), style: "text-decoration: none; color: #657786; font-size: 0.9rem; display: flex; align-items: center; gap: 4px;" do %>
        💬 <%= post.comments.count %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (9, 8, 7, 6, 5, 4, 3, 2, 1)
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 33