app/views/posts/index.html.erb

SELECT "users".* FROM "users" WHERE (LOWER(username) LIKE '%ad%') LIMIT 10
---
                <div class="w-6 h-6 rounded-full bg-slate-200 flex items-center justify-center font-bold text-[10px] text-slate-600">
                  <%= user.username.first.upcase %>