app/views/posts/show.html.erb

        <div class="w-12 h-12 rounded-full bg-slate-200 flex items-center justify-center font-bold text-slate-500">
          <%= @post.user.username.first.upcase %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

        <% if user_signed_in? %>
          <% liked = @post.likes.any? { |l| l.user_id == current_user.id } %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = 9
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = 35

            <%= link_to post_like_path(@post, id: 0), data: { turbo_method: :delete }, class: "text-red-500 font-bold flex items-center gap-2" do %>
              ❤️ <%= @post.likes.count %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = 35

            <%= link_to post_likes_path(@post), data: { turbo_method: :post }, class: "text-slate-400 hover:text-red-500 flex items-center gap-2" do %>
              🤍 <%= @post.likes.count %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = 9
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = 35

        <% else %>
          <span class="text-slate-400 flex items-center gap-2">🤍 <%= @post.likes.count %></span>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = 35

  <div class="bg-slate-50 p-6 rounded-2xl border border-slate-100">
    <h3 class="font-bold text-slate-800 mb-4">Комментарии (<%= @post.comments.count %>)</h3>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 9
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 35