app/views/posts/show.html.erb

  <div style="border: 1px solid #eee; padding: 20px; border-radius: 10px; background: #f9f9f9;">
    <h3 style="margin: 0 0 20px 0; font-size: 1.1rem; color: #333;">Комментарии (<%= @post.comments.count %>)</h3>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 31