app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.build(comment_params)
    @comment.user = current_user

    if @comment.save
---
INSERT INTO "comments" ("user_id", "post_id", "body", "created_at", "updated_at") VALUES (1, 8, 'я разбираюсь например', '2026-06-02 12:54:32.893155', '2026-06-02 12:54:32.893155') RETURNING "id"

  def destroy
    if @comment.user == current_user || @post.user == current_user
      @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = 1

  def set_comment
    @comment = @post.comments.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 8 AND "comments"."id" = 1 LIMIT 1