app/controllers/likes_controller.rb

  def create
    # Пытаемся создать лайк, только если его еще нет
    @post.likes.create(user: current_user)
---
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (1, 18, '2026-06-02 13:44:46.003385', '2026-06-02 13:44:46.003385') RETURNING "id"

  def destroy
    # Ищем конкретный лайк текущего юзера под этим постом
    @like = @post.likes.find_by(user: current_user)
    @like.destroy if @like
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = 18 AND "likes"."user_id" = 1 LIMIT 1
DELETE FROM "likes" WHERE "likes"."id" = 1