app/controllers/posts_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (9, 8, 7, 6, 5, 4, 3, 2, 1)
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (18, 9, 8, 7, 6, 5, 4, 3, 2, 1)
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" IN (4, 5) ORDER BY "posts"."created_at" DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 9
---
  def index
    @post = Post.new
    @posts = Post.includes(:comments, :likes, user: :avatar_attachment).order(created_at: :desc).page(params[:page]).per(10)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 4 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1
---
  def show
    @post = Post.includes(comments: :user).find(params[:id])

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES ('Новый пост №11', 1, '2026-06-03 06:59:36.267694', '2026-06-03 06:59:36.267694') RETURNING "id"
---
  def create
    @post = current_user.posts.build(post_params)
    @posts = Post.includes(:comments, :likes, user: :avatar_attachment).order(created_at: :desc).page(params[:page]).per(10)

    if @post.save

UPDATE "posts" SET "content" = 'Разбираешься в политике? изменил я вот пост', "updated_at" = '2026-06-02 12:39:47.303373' WHERE "posts"."id" = 8
---
  def update
    if @post.update(post_params)