app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE (LOWER(username) LIKE '%gmai%') LIMIT 10
---
def index
    @post = Post.new
    @posts = fetch_filtered_posts

    # Если активирована вкладка "Мои подписки", подгружаем подписки
    if params[:feed_scope] == 'following' && user_signed_in?
      @following_users = current_user.following.includes(:avatar_attachment)
    end

    # --- НОВАЯ ЛОГИКА ПОИСКА ПОЛЬЗОВАТЕЛЕЙ ---
    if params[:query].present?
      # Стираем лишние пробелы и переводим в нижний регистр для надежности
      search_query = params[:query].strip.downcase

      # Ищем по юзернейму частичные совпадения (защищено от SQL-инъекций)
      @search_results = User.where('LOWER(username) LIKE ?', "%#{search_query}%")
                            .includes(:avatar_attachment)
                            .limit(10) # Ограничим 10 пользователями, чтобы не перегружать страницу

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 32 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 4)
---
  def show
    @post = Post.includes(comments: :user).find(params[:id])

UPDATE "posts" SET "content" = 'ssss1213', "updated_at" = '2026-06-16 22:01:03.816150' WHERE "posts"."id" = 34
---
  def update
    if @post.update(post_params)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 34
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = 34
---
  def fetch_filtered_posts
    # Стартовый ленивый запрос к БД с защитой от N+1
    posts = Post.includes(:comments, :likes, user: :avatar_attachment)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 27 LIMIT 1
---
  def set_post
    # Твой стандартный поиск поста для edit/update/destroy
    @post = Post.find(params[:id])