app/controllers/users_controller.rb

  def show
    @posts = @user.posts
                  .includes(:comments, :likes, user: :avatar_attachment)
                  .order(created_at: :desc)
                  .page(params[:page])
                  .per(10)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (27, 24, 23, 22, 21, 20, 9, 7, 6, 5)
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (27, 24, 23, 22, 21, 20, 9, 7, 6, 5)
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1 ORDER BY "posts"."created_at" DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 9

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = '2026-06-16 22:12:11.143589', "bio" = '' WHERE "users"."id" = 12

  def follow
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1

  def unfollow
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1

def set_user
    # find_by не вызывает ошибку, а возвращает nil, если пользователь не найден
    @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1