app/models/user.rb

  def follow(other_user)
    following << other_user unless self == other_user
---
INSERT INTO "follows" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (1, 5, '2026-06-11 13:13:48.247279', '2026-06-11 13:13:48.247279') RETURNING "id"