app/controllers/users/sessions_controller.rb

  def new
    # Берем последние 3 поста, включая данные об авторах
    @recent_posts = Post.includes(:user).order(created_at: :desc).limit(3)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT 3
SELECT "users".* FROM "users" WHERE "users"."id" IN (12, 6, 1)